In [8]:
import pandas as pd
data = pd.read_csv('datasets/churn.csv')
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [9]:
categoric_columns = ['Geography', 'Geography', 'Gender']

for column in categoric_columns:
  data[column] = data[column].astype('category').cat.codes

In [10]:
data.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,0,0,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,2,0,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,0,0,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,0,0,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,2,0,43,2,125510.82,1,1,1,79084.10,0

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(data[['CreditScore', 'Age', 'Tenure', 'Balance', 'NumOfProducts',
                                                            'HasCrCard', 'IsActiveMember', 'EstimatedSalary',
                                                            'Geography', 'Gender']],
                                                   data[['Exited']], test_size=0.35)
X_train.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography,Gender
4714,567,23,9,93522.20,1,0,1,81425.61,0,0
9812,705,31,9,110941.93,2,1,0,163484.80,1,0
4369,662,22,2,126362.57,2,1,1,97382.80,0,0
4895,784,31,7,0.00,2,1,1,143204.41,0,1
4373,546,45,2,0.00,1,0,0,197789.83,2,0

In [12]:
import keras
from keras.models import Sequential
from keras.layers import Dense

In [50]:
classifier = Sequential()
classifier.add(Dense(units=7, kernel_initializer='normal', activation='relu', input_dim=10))
classifier.add(Dense(units=6, kernel_initializer='normal', activation='relu'))
classifier.add(Dense(units=4, kernel_initializer='normal', activation='relu'))
classifier.add(Dense(units=1, activation='sigmoid'))
classifier.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])
classifier.fit(X_train, y_train, batch_size=1, epochs=5)

Epoch 1/5
6500/6500 [==============================] - 4s 670us/step - loss: 0.5399 - accuracy: 0.7960
Epoch 2/5
6500/6500 [==============================] - 5s 796us/step - loss: 0.5062 - accuracy: 0.7960
Epoch 3/5
6500/6500 [==============================] - 5s 775us/step - loss: 0.5060 - accuracy: 0.7960
Epoch 4/5
6500/6500 [==============================] - 5s 772us/step - loss: 0.5061 - accuracy: 0.7960
Epoch 5/5
6500/6500 [==============================] - 5s 790us/step - loss: 0.5061 - accuracy: 0.7960

In [57]:
rezultati = classifier.evaluate(X_test, y_test, verbose=1)
str(round(rezultati[1] * 100, 2)) + '%'

3500/3500 [==============================] - 0s 8us/step

'79.69%'

In [51]:
y_test[:5] # Prvih 5 stvarnih vrijednosti

      Exited
9294       0
9613       1
9827       0
5198       0
3156       1

In [52]:
classifier.predict(X_test[:5]) > 0.5 # Previđene vrijednosti

array([[False],
       [False],
       [False],
       [False],
       [False]])

In [18]:
# Sada ćemo skalirati podatke pa ponovno trenirati istu neuronsku mrežu

from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler.fit(X_train)

X_train_scaled = scaler.transform(X_train)
X_test_scaled = scaler.transform(X_test)

In [19]:
X_train.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography,Gender
4714,567,23,9,93522.20,1,0,1,81425.61,0,0
9812,705,31,9,110941.93,2,1,0,163484.80,1,0
4369,662,22,2,126362.57,2,1,1,97382.80,0,0
4895,784,31,7,0.00,2,1,1,143204.41,0,1
4373,546,45,2,0.00,1,0,0,197789.83,2,0

In [61]:
X_train_scaled[:5] # Vidimo da su sada podaci potpuno izmjenjeni.

array([[-0.85734948, -1.50910043,  1.37179648,  0.26172909, -0.90181222,
        -1.55308515,  0.97058624, -0.33132885, -0.90444   , -1.10040191],
       [ 0.56445203, -0.74747589,  1.37179648,  0.54087232,  0.81517063,
         0.6438797 , -1.03030515,  1.09646626,  0.31321949, -1.10040191],
       [ 0.12142692, -1.6043035 , -1.04081764,  0.78798104,  0.81517063,
         0.6438797 ,  0.97058624, -0.05368051, -0.90444   , -1.10040191],
       [ 1.37838189, -0.74747589,  0.68247816, -1.23692151,  0.81517063,
         0.6438797 ,  0.97058624,  0.74359607, -0.90444   ,  0.90875888],
       [-1.07371058,  0.58536704, -1.04081764, -1.23692151, -0.90181222,
        -1.55308515, -1.03030515,  1.69335924,  1.53087897, -1.10040191]])

In [58]:
# Copy-paste iste arhitekutre mreže, ali koristimo X_train_scaled

classifier = Sequential()
classifier.add(Dense(units=7, kernel_initializer='normal', activation='relu', input_dim=10))
classifier.add(Dense(units=6, kernel_initializer='normal', activation='relu'))
classifier.add(Dense(units=4, kernel_initializer='normal', activation='relu'))
classifier.add(Dense(units=1, activation='sigmoid'))
classifier.compile(optimizer='adam', loss='binary_crossentropy', metrics=['accuracy'])
classifier.fit(X_train_scaled, y_train, batch_size=1, epochs=5)

Epoch 1/5
6500/6500 [==============================] - 4s 610us/step - loss: 0.4473 - accuracy: 0.7960
Epoch 2/5
6500/6500 [==============================] - 4s 593us/step - loss: 0.4206 - accuracy: 0.8208
Epoch 3/5
6500/6500 [==============================] - 4s 604us/step - loss: 0.4090 - accuracy: 0.8334
Epoch 4/5
6500/6500 [==============================] - 4s 673us/step - loss: 0.3772 - accuracy: 0.8532
Epoch 5/5
6500/6500 [==============================] - 5s 752us/step - loss: 0.3587 - accuracy: 0.8588

In [59]:
rezultati = classifier.evaluate(X_test_scaled, y_test, verbose=1)
str(round(rezultati[1] * 100, 2)) + '%'

3500/3500 [==============================] - 0s 12us/step

'85.46%'

In [48]:
y_test[:5]

      Exited
9294       0
9613       1
9827       0
5198       0
3156       1

In [60]:
classifier.predict(X_test_scaled[:5]) > 0.5 # Previđene vrijednosti

array([[False],
       [ True],
       [False],
       [False],
       [False]])